app/controllers/admin/settings_controller.rb

  def index
    @preference = Preference.first_or_create(song_sort_order: "DESC", artist_sort_order: "DESC")
---
INSERT INTO "preferences" ("song_sort_order", "artist_sort_order", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["song_sort_order", "DESC"], ["artist_sort_order", "DESC"], ["created_at", "2016-02-01 23:06:05.250325"], ["updated_at", "2016-02-01 23:06:05.250325"]]
SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1

  def update
    @preference = Preference.find(params[:id])
    @preference.update(preference_params)
---
SELECT  "preferences".* FROM "preferences" WHERE "preferences"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "preferences" SET "artist_sort_order" = ?, "updated_at" = ? WHERE "preferences"."id" = ?  [["artist_sort_order", "ASC"], ["updated_at", "2016-02-01 23:13:41.334665"], ["id", 1]]